app/controllers/profiles_controller.rb

  def create
    @profile = Profile.create(params[:profile], user_id: current_user.id)
    current_user.profile = @profile
    @profile = current_user.profile

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("addr_line1", "addr_line2", "city", "contact", "created_at", "first_name", "last_name", "phone", "state", "updated_at", "user_id", "user_name", "zipcode") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "profiles" SET "user_id" = 1, "updated_at" = '2013-10-30 12:53:55.157062' WHERE "profiles"."id" = 1

  def update
    @profile = Profile.find(params[:id])

    respond_to do |format|
      if @profile.update_attributes(params[:profile])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "profiles" SET "last_name" = 'Gertig', "user_name" = 'jcgertig', "updated_at" = '2013-10-30 13:03:01.935019' WHERE "profiles"."id" = 1